export interface BlogEntry {
  slug: string;
  image: string;
  date: string;
  author: string;
  title: string;
  description: string;
  content: string[];
  tags: string[];
}

export const blogData: BlogEntry[] = [
  {
  slug: 'hindi-poem-sukoon-ki-talaash',
  image: 'assets/image/blog/SukoonKiTalaash.png',
  date: '2025-07-27',
  author: 'Krishna Kumar Pandey',
  title: '"सुकून की तलाश" – एक हिंदी कविता',
  description: 'जीवन की जद्दोजहद, उम्मीद और सुकून की तलाश पर आधारित एक भावुक हिंदी कविता।',
  tags: ['कविता'],
  content: [
          `रात भर सोचता रहा,
          अपने को कोसता रहा।
          काश की होती पढ़ाई, तो
          होती आज मोटी कमाई।

          गुजरा हुआ जो कल था,
          चुभ रहा उस पल था।
          एक प्रश्न था जेहन में, जो प्रायः
          होता है हर गरीब के मन में,
          क्या करूँ क्या ना करूँ,
          अब जिन्दा रहूँ या मरुँ।

          जिंदगी सस्ती सी लगती थी, क्यूँकि
          मेरा जीवन एक डूबती हुई कश्ती थी।
          फिर भी मन में थी एक आस, क्यूँकि
          मुझे अपनी काबिलियत पर था विश्वास।

          आज नहीं तो कल सही,
          मिलेगी तो मंजिल है ही।
          यही सोचकर मैं चलता रहा,
          रात-दिन गिनता रहा।
          आखिर आ गया वह समय था, जिसके लिए
          हर दिन मर-मर कर जिया मैं था।

          यह एक खूबसूरत एहसास था,
          जो चाहो वह अपने पास था।
          रूपया था, पैसा था,
          घर भी जन्नत जैसा था।

          फिर भी एक चीज की कमी थी,
          वह चीज "सुकून की घड़ी" थी।
          मानों वह बर्फ सी जमी थी,
          शायद अंदर आग की कमी थी।

          जिसको पाने की तमन्ना में, अमीर
          गरीब एक तल पर आ जाएँ,
          जिसके मिलने से मानो सब मिल जाये,
          वह सुकून पैसे-रुपयों से कैसे खरीदा जाए?`
    ]
  }
];
